Repository: itonus/PriceLens
Catalog: PriceLens/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# action.apply
source: Apply
ru: Применить

# action.cancel
source: Cancel
ru: Отмена

# action.close
source: Close
ru: Закрыть

# action.done
source: Done
ru: Готово

# action.edit
source: Edit
ru: Изменить

# action.retry
source: Retry
ru: Повторить

# action.search
source: Search
ru: Искать

# decision.betterOnline
source: Better online
ru: В интернете выгоднее

# decision.compareCarefully
source: Compare carefully
ru: Проверьте предложения

# decision.fairPrice
source: Fair price
ru: Нормальная цена

# decision.goodHere
source: Good price here
ru: Хорошая цена здесь

# fallback.blocked
source: %@ needs to be opened directly
ru: %@ нужно открыть напрямую

# fallback.openAllegro
source: Open Allegro results
ru: Открыть результаты Allegro

# fallback.openGoogle
source: Open Google results
ru: Открыть результаты Google

# fallback.unreadable
source: %@ results couldn't be read
ru: Не удалось прочитать результаты %@

# history.clear
source: Clear history
ru: Очистить историю

# history.clear.confirm
source: Delete all scan history from this device?
ru: Удалить всю историю сканирований с этого устройства?

# history.empty
source: No scans yet
ru: Пока нет сканирований

# history.empty.hint
source: Scanned products will appear here.
ru: Отсканированные товары появятся здесь.

# history.title
source: History
ru: История

# identity.barcode
source: Barcode match
ru: Совпадение по штрихкоду

# identity.likelyModel
source: Likely exact model
ru: Вероятно, точная модель

# identity.textSearch
source: Text search
ru: Поиск по тексту

# match.exact
source: Exact
ru: Точное совпадение

# match.high
source: High match
ru: Высокое совпадение

# match.possible
source: Possible match
ru: Возможное совпадение

# offer.deliveryUnknown
source: Delivery unknown — total unavailable
ru: Доставка неизвестна — итог недоступен

# offer.open
source: Open
ru: Открыть

# offer.totalFormat
source: %1$@ delivery · %2$@ total
ru: доставка %1$@ · итого %2$@

# results.addStorePrice
source: Add store price
ru: Добавить цену в магазине

# results.bestOnline
source: Best online
ru: Лучшая цена онлайн

# results.noOffers
source: No offers extracted
ru: Не удалось извлечь предложения

# results.noOffers.hint
source: You can still open the provider search directly.
ru: Вы всё ещё можете открыть поиск напрямую.

# results.offers
source: Offers
ru: Предложения

# results.pricePlaceholder
source: Store price
ru: Цена в магазине

# results.queryPlaceholder
source: Product query
ru: Запрос товара

# results.rescan
source: Rescan
ru: Сканировать снова

# results.rescan.hint
source: Close results and scan again
ru: Закрыть результаты и сканировать снова

# results.save
source: Save
ru: Экономия

# results.storePrice
source: Store price
ru: Цена в магазине

# results.viewOffers
source: View offers
ru: Смотреть предложения

# scanner.manual.placeholder
source: Product name or barcode
ru: Название товара или штрихкод

# scanner.manual.title
source: Type a product name
ru: Введите название товара

# scanner.permission.allow
source: Allow camera access
ru: Разрешить доступ к камере

# scanner.permission.denied
source: Camera access is off. You can enable it in Settings or type a product name manually.
ru: Доступ к камере выключен. Включите его в Настройках или введите название вручную.

# scanner.permission.openSettings
source: Open Settings
ru: Открыть Настройки

# scanner.permission.why
source: PriceLens uses the camera to recognize product barcodes, labels, and prices for comparison.
ru: PriceLens использует камеру для распознавания штрихкодов, этикеток и цен, чтобы сравнивать предложения.

# scanner.status.barcodeFound
source: Barcode found
ru: Штрихкод найден

# scanner.status.locked
source: Product locked
ru: Товар определён

# scanner.status.offline
source: No connection
ru: Нет подключения

# scanner.status.pointAtProduct
source: Point at a product
ru: Наведите камеру на товар

# scanner.status.readingLabel
source: Reading label…
ru: Считываю этикетку…

# scanner.status.searching
source: Searching Google + Allegro…
ru: Ищу в Google и Allegro…

# scanner.status.tapAProduct
source: Tap a product
ru: Коснитесь товара

# scanner.torch
source: Torch
ru: Фонарик

# scanner.typeInstead
source: Type instead
ru: Ввести вручную

# scanner.typeInstead.hint
source: Enter a product name manually
ru: Ввести название товара вручную

# scanner.unsupported
source: The live scanner is not available on this device. You can still search by typing a product name.
ru: Сканер недоступен на этом устройстве. Вы можете найти товар, введя название вручную.

# settings.about
source: About
ru: О программе

# settings.data
source: Data
ru: Данные

# settings.experimental.note
source: Google and Allegro results use experimental on-device extraction and may open the provider page directly.
ru: Результаты Google и Allegro используют экспериментальное извлечение на устройстве и могут открывать страницу сервиса напрямую.

# settings.language
source: Language
ru: Язык

# settings.language.system
source: System
ru: Системный

# settings.privacy.note
source: Everything stays on this iPhone: scans, prices, and history are never uploaded.
ru: Всё остаётся на этом iPhone: сканы, цены и история никуда не отправляются.

# settings.search
source: Search
ru: Поиск

# settings.title
source: Settings
ru: Настройки

# settings.version
source: Version
ru: Версия

# sort.bestMatch
source: Best match
ru: Лучшее совпадение

# sort.lowestItemPrice
source: Lowest item price
ru: Сначала дешевле

# sort.lowestTotal
source: Lowest known total
ru: Сначала дешевле с доставкой

# fallback.openProvider
source: Open %@ results
ru: Открыть результаты %@

# results.openAllegro
source: Open in Allegro
ru: Открыть в Allegro
